---
kind: type
id: T:Autodesk.Revit.DB.NumberingSchemaTypes.StructuralNumberingSchemas
source: html/f7e84519-92bf-bad3-df1f-bd05967eaeb0.htm
---
# Autodesk.Revit.DB.NumberingSchemaTypes.StructuralNumberingSchemas

A collection of types of built-in Numbering Schemas that are used for numbering structure elements.

## Syntax (C#)
```csharp
public static class StructuralNumberingSchemas
```